Revit 2027 API
IFCData.PrimitiveType Property
 The primitive data type.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCDataPrimitiveType PrimitiveType { get; set; }
Public Property PrimitiveType As IFCDataPrimitiveType
	Get
	Set
public:
property IFCDataPrimitiveType PrimitiveType {
	IFCDataPrimitiveType get ();
	void set (IFCDataPrimitiveType value);
}
member PrimitiveType : IFCDataPrimitiveType with get, set
Property Value
IFCDataPrimitiveType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace